/**
 * Copyright (c) 2011 Trusted Logic S.A.
 * All Rights Reserved.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place, Suite 330, Boston,
 * MA 02111-1307 USA
 */

#include "tf_defs.h"
#include "tf_util.h"
#include "tf_crypto.h"
#include "tf_dma.h"
#include "tf_zebra.h"

#include <linux/io.h>
#include <linux/crypto.h>
#include <crypto/internal/hash.h>

/*
 * SHA2/MD5 Hardware Accelerator: Base address for SHA2/MD5 HIB2
 * This is referenced as the SHA2MD5 module in the Crypto TRM
 */
#define DIGEST1_REGS_HW_ADDR			0x4B101000

/*
 * IRQSTATUS register Masks
 */
#define DIGEST_IRQSTATUS_OUTPUT_READY_BIT	(1 << 0)
#define DIGEST_IRQSTATUS_INPUT_READY_BIT	(1 << 1)
#define DIGEST_IRQSTATUS_PARTHASH_READY_BIT	(1 << 2)
#define DIGEST_IRQSTATUS_CONTEXT_READY_BIT	(1 << 3)

/*
 * MODE register Masks
 */
#define DIGEST_MODE_GET_ALGO(x) \
	(cpu_is_omap54xx() ? ((x) & 0x7) : (((x) & 0x6) >> 1))
#define DIGEST_MODE_GET_OMAP44XX_ALGO(x)        ((x & 0x6) >> 1)
#define DIGEST_MODE_GET_OMAP54XX_ALGO(x)        ((x) & 0x7)
#define DIGEST_MODE_SET_ALGO(x, a) \
	(cpu_is_omap54xx() ? \
		((a) | ((x) & 0xFFFFFFF8)) : (((a) << 1) | ((x) & 0xFFFFFFF9)))

#define DIGEST_MODE_ALGO_CONST_BIT		(1 << 3)
#define DIGEST_MODE_CLOSE_HASH_BIT		(1 << 4)

/*
 * SYSCONFIG register masks
 */
#define DIGEST_SYSCONFIG_PIT_EN_BIT		(1 << 2)
#define DIGEST_SYSCONFIG_PDMA_EN_BIT		(1 << 3)
#define DIGEST_SYSCONFIG_PCONT_SWT_BIT		(1 << 6)
#define DIGEST_SYSCONFIG_PADVANCED_BIT		(1 << 7)

/*-------------------------------------------------------------------------*/
/*				 Digest Context				*/
/*-------------------------------------------------------------------------*/
/**
 * This structure contains the registers of the SHA1/MD5 HW accelerator.
 */
struct sha1_md5_reg {
	u32 SHA_ODIGEST_A;		/* 0x00 Outer Digest A      */
	u32 SHA_ODIGEST_B;		/* 0x04 Outer Digest B      */
	u32 SHA_ODIGEST_C;		/* 0x08 Outer Digest C      */
	u32 SHA_ODIGEST_D;		/* 0x0C Outer Digest D      */
	u32 SHA_ODIGEST_E;		/* 0x10 Outer Digest E      */
	u32 SHA_ODIGEST_F;		/* 0x14 Outer Digest F      */
	u32 SHA_ODIGEST_G;		/* 0x18 Outer Digest G      */
	u32 SHA_ODIGEST_H;		/* 0x1C Outer Digest H      */
	u32 SHA_IDIGEST_A;		/* 0x20 Inner Digest A      */
	u32 SHA_IDIGEST_B;		/* 0x24 Inner Digest B      */
	u32 SHA_IDIGEST_C;		/* 0x28 Inner Digest C      */
	u32 SHA_IDIGEST_D;		/* 0x2C Inner Digest D      */
	u32 SHA_IDIGEST_E;		/* 0x30 Inner Digest E      */
	u32 SHA_IDIGEST_F;		/* 0x34 Inner Digest F      */
	u32 SHA_IDIGEST_G;		/* 0x38 Inner Digest G      */
	u32 SHA_IDIGEST_H;		/* 0x3C Inner Digest H      */
	u32 SHA_DIGEST_COUNT;		/* 0x40 Digest count        */
	u32 SHA_MODE;			/* 0x44 Digest mode         */
	u32 SHA_LENGTH;			/* 0x48 Data length         */

	u32 reserved0[13];

	u32 SHA_DIN_0;			/* 0x80 Data 0              */
	u32 SHA_DIN_1;			/* 0x84 Data 1              */
	u32 SHA_DIN_2;			/* 0x88 Data 2              */
	u32 SHA_DIN_3;			/* 0x8C Data 3              */
	u32 SHA_DIN_4;			/* 0x90 Data 4              */
	u32 SHA_DIN_5;			/* 0x94 Data 5              */
	u32 SHA_DIN_6;			/* 0x98 Data 6              */
	u32 SHA_DIN_7;			/* 0x9C Data 7              */
	u32 SHA_DIN_8;			/* 0xA0 Data 8              */
	u32 SHA_DIN_9;			/* 0xA4 Data 9              */
	u32 SHA_DIN_10;			/* 0xA8 Data 10             */
	u32 SHA_DIN_11;			/* 0xAC Data 11             */
	u32 SHA_DIN_12;			/* 0xB0 Data 12             */
	u32 SHA_DIN_13;			/* 0xB4 Data 13             */
	u32 SHA_DIN_14;			/* 0xB8 Data 14             */
	u32 SHA_DIN_15;			/* 0xBC Data 15             */
	u32 SHA_DIN_16;			/* 0xC0 Data 16             */
	u32 SHA_DIN_17;			/* 0xC4 Data 17             */
	u32 SHA_DIN_18;			/* 0xC8 Data 18             */
	u32 SHA_DIN_19;			/* 0xCC Data 19             */
	u32 SHA_DIN_20;			/* 0xD0 Data 20             */
	u32 SHA_DIN_21;			/* 0xD4 Data 21             */
	u32 SHA_DIN_22;			/* 0xD8 Data 22             */
	u32 SHA_DIN_23;			/* 0xDC Data 23             */
	u32 SHA_DIN_24;			/* 0xE0 Data 24             */
	u32 SHA_DIN_25;			/* 0xE4 Data 25             */
	u32 SHA_DIN_26;			/* 0xE8 Data 26             */
	u32 SHA_DIN_27;			/* 0xEC Data 27             */
	u32 SHA_DIN_28;			/* 0xF0 Data 28             */
	u32 SHA_DIN_29;			/* 0xF4 Data 29             */
	u32 SHA_DIN_30;			/* 0xF8 Data 30             */
	u32 SHA_DIN_31;			/* 0xFC Data 31             */
	u32 REVISION;			/* 0x100 Revision           */

	u32 reserved2[3];

	u32 SYSCONFIG;			/* 0x110 Config             */
	u32 SYSSTATUS;			/* 0x114 Status             */
	u32 IRQSTATUS;			/* 0x118 IRQ Status         */
	u32 IRQENABLE;			/* 0x11C IRQ Enable         */

	u32 reserved3[56];
	u32 SHA512_ODIGEST_A;		/* 0x200 Outer Digest A      */
	u32 SHA512_ODIGEST_B;		/* 0x204 Outer Digest B      */
	u32 SHA512_ODIGEST_C;		/* 0x208 Outer Digest C      */
	u32 SHA512_ODIGEST_D;		/* 0x20C Outer Digest D      */
	u32 SHA512_ODIGEST_E;		/* 0x210 Outer Digest E      */
	u32 SHA512_ODIGEST_F;		/* 0x214 Outer Digest F      */
	u32 SHA512_ODIGEST_G;		/* 0x218 Outer Digest G      */
	u32 SHA512_ODIGEST_H;		/* 0x21C Outer Digest H      */
	u32 SHA512_ODIGEST_I;		/* 0x220 Outer Digest I      */
	u32 SHA512_ODIGEST_J;		/* 0x224 Outer Digest J      */
	u32 SHA512_ODIGEST_K;		/* 0x228 Outer Digest K      */
	u32 SHA512_ODIGEST_L;		/* 0x22C Outer Digest L      */
	u32 SHA512_ODIGEST_M;		/* 0x230 Outer Digest M      */
	u32 SHA512_ODIGEST_N;		/* 0x234 Outer Digest N      */
	u32 SHA512_ODIGEST_O;		/* 0x238 Outer Digest O      */
	u32 SHA512_ODIGEST_P;		/* 0x23C Outer Digest P      */

	u32 SHA512_IDIGEST_A;		/* 0x240 Inner Digest A      */
	u32 SHA512_IDIGEST_B;		/* 0x244 Inner Digest B      */
	u32 SHA512_IDIGEST_C;		/* 0x248 Inner Digest C      */
	u32 SHA512_IDIGEST_D;		/* 0x24C Inner Digest D      */
	u32 SHA512_IDIGEST_E;		/* 0x250 Inner Digest E      */
	u32 SHA512_IDIGEST_F;		/* 0x254 Inner Digest F      */
	u32 SHA512_IDIGEST_G;		/* 0x258 Inner Digest G      */
	u32 SHA512_IDIGEST_H;		/* 0x25C Inner Digest H      */
	u32 SHA512_IDIGEST_I;		/* 0x260 Inner Digest I      */
	u32 SHA512_IDIGEST_J;		/* 0x264 Inner Digest J      */
	u32 SHA512_IDIGEST_K;		/* 0x268 Inner Digest K      */
	u32 SHA512_IDIGEST_L;		/* 0x26C Inner Digest L      */
	u32 SHA512_IDIGEST_M;		/* 0x270 Inner Digest M      */
	u32 SHA512_IDIGEST_N;		/* 0x274 Inner Digest N      */
	u32 SHA512_IDIGEST_O;		/* 0x278 Inner Digest O      */
	u32 SHA512_IDIGEST_P;		/* 0x27C Inner Digest P      */

	u32 SHA512_DIGEST_COUNT;	/* 0x280 Digest count        */
	u32 SHA512_MODE;		/* 0x284 Digest mode         */
	u32 SHA512_LENGTH;		/* 0x288 Data length         */

};

static struct sha1_md5_reg *sha1_md5_reg;

static const u8 md5OverEmptyString[] = {
	0xd4, 0x1d, 0x8c, 0xd9, 0x8f, 0x00, 0xb2, 0x04,
	0xe9, 0x80, 0x09, 0x98, 0xec, 0xf8, 0x42, 0x7e
};

static const u8 sha1OverEmptyString[] = {
	0xda, 0x39, 0xa3, 0xee, 0x5e, 0x6b, 0x4b, 0x0d,
	0x32, 0x55, 0xbf, 0xef, 0x95, 0x60, 0x18, 0x90,
	0xaf, 0xd8, 0x07, 0x09
};

static const u8 sha224OverEmptyString[] = {
	0xd1, 0x4a, 0x02, 0x8c, 0x2a, 0x3a, 0x2b, 0xc9,
	0x47, 0x61, 0x02, 0xbb, 0x28, 0x82, 0x34, 0xc4,
	0x15, 0xa2, 0xb0, 0x1f, 0x82, 0x8e, 0xa6, 0x2a,
	0xc5, 0xb3, 0xe4, 0x2f
};

static const u8 sha256OverEmptyString[] = {
	0xe3, 0xb0, 0xc4, 0x42, 0x98, 0xfc, 0x1c, 0x14,
	0x9a, 0xfb, 0xf4, 0xc8, 0x99, 0x6f, 0xb9, 0x24,
	0x27, 0xae, 0x41, 0xe4, 0x64, 0x9b, 0x93, 0x4c,
	0xa4, 0x95, 0x99, 0x1b, 0x78, 0x52, 0xb8, 0x55
};

static const u8 sha384OverEmptyString[] = {
	0x38, 0xb0, 0x60, 0xa7, 0x51, 0xac, 0x96, 0x38,
